[options]
mode prove
depth 20

[engines]
smtbmc yices

[script]
read -sv DCacheFrontendArbiter.sv
read -formal -sv DCacheFrontendArbiter_formal.sv
hierarchy -top DCacheFrontendArbiter_formal
clk2fflogic
prep -nordff -top DCacheFrontendArbiter_formal
dffunmap

[files]
Quartus/rtl/common/DCacheFrontendArbiter.sv
formal/DCacheFrontendArbiter_formal.sv
