[options]
mode prove
depth 40

[engines]
smtbmc yices

[script]
read -formal -sv DCache2Way.sv BlockRam.sv DPRam.sv DCache2Way_formal.sv
chformal -assume -remove \\FORMAL_TIGHT_ENV 0
hierarchy -top DCache2Way_formal
clk2fflogic
prep -nordff -top DCache2Way_formal
dffunmap

[files]
Quartus/rtl/common/DCache2Way.sv
Quartus/rtl/common/BlockRam.sv
Quartus/rtl/common/DPRam.sv
formal/DCache2Way_formal.sv
