[options]
mode prove
depth 25

[engines]
smtbmc yices

[script]
read -formal -sv FPU_IEEE754_AddSub.v FPU_IEEE754_AddSub_formal.sv
hierarchy -top FPU_IEEE754_AddSub_formal
clk2fflogic
prep -nordff -top FPU_IEEE754_AddSub_formal
dffunmap

[files]
Quartus/rtl/FPU8087/FPU_IEEE754_AddSub.v
formal/FPU_IEEE754_AddSub_formal.sv
