[options]
mode prove
depth 30

[engines]
smtbmc yices

[script]
read -formal -sv FPU_Polynomial_Evaluator.v FPU_Poly_Coeff_ROM_Formal.sv FPU_Polynomial_Evaluator_formal.sv
hierarchy -top FPU_Polynomial_Evaluator_formal
clk2fflogic
prep -nordff -top FPU_Polynomial_Evaluator_formal
dffunmap

[files]
Quartus/rtl/FPU8087/FPU_Polynomial_Evaluator.v
formal/FPU_Poly_Coeff_ROM_Formal.sv
formal/FPU_Polynomial_Evaluator_formal.sv
