[options]
mode prove
depth 20

[engines]
smtbmc yices

[script]
read -formal -sv LoadStore.sv LoadStore_formal.sv
hierarchy -top LoadStore_formal
clk2fflogic
prep -nordff -top LoadStore_formal
dffunmap

[files]
Quartus/rtl/CPU/LoadStore.sv
formal/LoadStore_formal.sv
