[options]
mode prove
depth 20

[engines]
smtbmc yices

[script]
read -formal -sv \
    RegisterEnum.sv \
    RegisterFile_flat.sv \
    RegisterFile_formal.sv
hierarchy -top RegisterFile_formal
clk2fflogic
prep -nordff -top RegisterFile_formal
dffunmap

[files]
Quartus/rtl/CPU/RegisterEnum.sv
formal/RegisterFile_flat.sv
formal/RegisterFile_formal.sv
